app/controllers/registrations_controller.rb

  def create
    build_resource(sign_up_params)

    resource.class.transaction do
      resource.save
      yield resource if block_given?
        if resource.persisted?
          @payment = Payment.new({ email: params["user"]["email"],
                                   token: params[:payment]["token"], user_id: resource.id })

          flash[:error] = "Please check registration errors" unless @payment.valid?

          begin
            @payment.process_payment
            @payment.save
          rescue Exception => e
            flash[:error] = e.message

            resource.destroy
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]